experimentacion/results/exp1-report/statistics.json
{
  "GET /inventario/MED-ANALG-ACETAM-650MG-10TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANALG-ACETAM-650MG-10TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.42031051964511,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 1198.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 230.0,
    "throughput" : 5.847097294142713,
    "receivedKBytesPerSec" : 2.0784603662772927,
    "sentKBytesPerSec" : 6.281061546442367
  },
  "GET /inventario/MED-GI-PANTOP-40MG-28TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-GI-PANTOP-40MG-28TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.42031051964506,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 1016.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 226.73999999999978,
    "throughput" : 5.851411959054949,
    "receivedKBytesPerSec" : 2.0571297744351145,
    "sentKBytesPerSec" : 6.262839362426
  },
  "GET /inventario/MED-ANALG-ACETAM-500MG-24TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANALG-ACETAM-500MG-24TAB/disponibilidad",
    "sampleCount" : 6313,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.96626009821001,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 532.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 193.85999999999967,
    "throughput" : 5.84599286035087,
    "receivedKBytesPerSec" : 2.0837839865471786,
    "sentKBytesPerSec" : 6.279875142955037
  },
  "GET /inventario/MED-OTC-SUERO-ORAL-500ML/disponibilidad" : {
    "transaction" : "GET /inventario/MED-OTC-SUERO-ORAL-500ML/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.91017110266152,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 588.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 195.0,
    "throughput" : 5.860822186443227,
    "receivedKBytesPerSec" : 2.0547290948223833,
    "sentKBytesPerSec" : 6.272911246427517
  },
  "GET /inventario/MED-ANTIB-CEFAL-500MG-12CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANTIB-CEFAL-500MG-12CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.23685044359942,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 720.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 232.0,
    "throughput" : 5.854782472384108,
    "receivedKBytesPerSec" : 2.0697534616679634,
    "sentKBytesPerSec" : 6.283599547998178
  },
  "GET /inventario/MED-RESP-BECLOM-50MCG-200D/disponibilidad" : {
    "transaction" : "GET /inventario/MED-RESP-BECLOM-50MCG-200D/disponibilidad",
    "sampleCount" : 6311,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.98542227856122,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 497.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 168.0,
    "throughput" : 5.855810298097952,
    "receivedKBytesPerSec" : 2.070134935438555,
    "sentKBytesPerSec" : 6.278984089171437
  },
  "GET /inventario/MED-CARD-ENALAP-10MG-30TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-CARD-ENALAP-10MG-30TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.31321292775615,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 715.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 203.95999999999913,
    "throughput" : 5.857303394767587,
    "receivedKBytesPerSec" : 2.070655520127985,
    "sentKBytesPerSec" : 6.280585085405089
  },
  "GET /inventario/MED-DERM-MUPIRO-2PCT-15G/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DERM-MUPIRO-2PCT-15G/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.07398605830173,
    "medianResTime" : 124.0,
    "minResTime" : 113.0,
    "maxResTime" : 1002.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 218.08999999999924,
    "throughput" : 5.8598101688873045,
    "receivedKBytesPerSec" : 2.054363415223995,
    "sentKBytesPerSec" : 6.271828071387194
  },
  "GET /inventario/MED-ANALG-NAPROX-250MG-20TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANALG-NAPROX-250MG-20TAB/disponibilidad",
    "sampleCount" : 6313,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.02882939965149,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 625.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.29999999999927,
    "pct3ResTime" : 197.75999999999476,
    "throughput" : 5.850879948989002,
    "receivedKBytesPerSec" : 2.079804981867184,
    "sentKBytesPerSec" : 6.285124945203029
  },
  "GET /inventario/MED-GI-LOPERA-2MG-12CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-GI-LOPERA-2MG-12CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.18773764258559,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 935.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 224.47999999999956,
    "throughput" : 5.852279997107238,
    "receivedKBytesPerSec" : 2.0517306910456035,
    "sentKBytesPerSec" : 6.258053317219165
  },
  "GET /inventario/MED-OTC-ORALSOL-SALES-4SOB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-OTC-ORALSOL-SALES-4SOB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.7248098859317,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 743.0,
    "pct1ResTime" : 132.69999999999982,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 159.8699999999999,
    "throughput" : 5.86137186931518,
    "receivedKBytesPerSec" : 2.072093794486113,
    "sentKBytesPerSec" : 6.284947570808659
  },
  "GET /inventario/MED-LAX-SENNOS-8P6MG-20TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-LAX-SENNOS-8P6MG-20TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.13323827629891,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 872.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 180.0,
    "throughput" : 5.860588194331608,
    "receivedKBytesPerSec" : 2.066097148394884,
    "sentKBytesPerSec" : 6.2841072630626025
  },
  "GET /inventario/MED-CARD-LOSART-50MG-30TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-CARD-LOSART-50MG-30TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.072877059569,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 1601.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 177.21999999999935,
    "throughput" : 5.8571294683578605,
    "receivedKBytesPerSec" : 2.0705795352156198,
    "sentKBytesPerSec" : 6.280398590094658
  },
  "GET /inventario/MED-DERM-HYDROC-1PCT-30G/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DERM-HYDROC-1PCT-30G/disponibilidad",
    "sampleCount" : 6313,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.26199904958048,
    "medianResTime" : 125.0,
    "minResTime" : 114.0,
    "maxResTime" : 841.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 223.85999999999967,
    "throughput" : 5.8595852902411405,
    "receivedKBytesPerSec" : 2.0542882023403997,
    "sentKBytesPerSec" : 6.27158738096122
  },
  "GET /inventario/MED-ALERG-LORATA-10MG-10TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ALERG-LORATA-10MG-10TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.1506653992394,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 1413.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 220.34999999999945,
    "throughput" : 5.852285423154912,
    "receivedKBytesPerSec" : 2.074589461528548,
    "sentKBytesPerSec" : 6.28091960942114
  },
  "GET /inventario/MED-ANTIB-AZITH-500MG-3TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANTIB-AZITH-500MG-3TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.67648922686968,
    "medianResTime" : 124.0,
    "minResTime" : 112.0,
    "maxResTime" : 739.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 168.0,
    "throughput" : 5.85405485115843,
    "receivedKBytesPerSec" : 2.063797500433582,
    "sentKBytesPerSec" : 6.277101783761675
  },
  "GET /inventario/MED-GI-OMEPRA-20MG-14CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-GI-OMEPRA-20MG-14CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.77740811153362,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 322.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 169.0,
    "throughput" : 5.8515746965747155,
    "receivedKBytesPerSec" : 2.0571978505753306,
    "sentKBytesPerSec" : 6.2630135424276245
  },
  "GET /inventario/MED-ALERG-CETIRI-10MG-20TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ALERG-CETIRI-10MG-20TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.22750316856785,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 1056.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 220.82999999999902,
    "throughput" : 5.853528253103891,
    "receivedKBytesPerSec" : 2.0750264125160895,
    "sentKBytesPerSec" : 6.282253466954273
  },
  "GET /inventario/MED-ANTITUSS-AMBROX-15MG5ML-120ML/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANTITUSS-AMBROX-15MG5ML-120ML/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.6796577946767,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 904.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 231.8699999999999,
    "throughput" : 5.859929851663562,
    "receivedKBytesPerSec" : 2.1116385046688193,
    "sentKBytesPerSec" : 6.323459459070544
  },
  "GET /inventario/MED-CARD-ATORVA-20MG-30TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-CARD-ATORVA-20MG-30TAB/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.93678707224352,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 1222.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 165.60999999999967,
    "throughput" : 5.859086736204644,
    "receivedKBytesPerSec" : 2.0712787094785954,
    "sentKBytesPerSec" : 6.282497301125684
  },
  "GET /inventario/MED-ANTITUSS-DEXTRO-120ML/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANTITUSS-DEXTRO-120ML/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.79705323193897,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 787.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 154.0,
    "throughput" : 5.859685051211902,
    "receivedKBytesPerSec" : 2.0657678744995085,
    "sentKBytesPerSec" : 6.277416505058063
  },
  "GET /inventario/MED-ANTIB-AMOXI-500MG-12CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANTIB-AMOXI-500MG-12CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.86660329531061,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 766.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 215.65999999999804,
    "throughput" : 5.854000558318811,
    "receivedKBytesPerSec" : 2.069480666124423,
    "sentKBytesPerSec" : 6.282760364836302
  },
  "GET /inventario/MED-DERM-CLOT-CREMA-20G/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DERM-CLOT-CREMA-20G/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.35884030418242,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 924.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 137.0,
    "pct3ResTime" : 220.6999999999989,
    "throughput" : 5.85969593079766,
    "receivedKBytesPerSec" : 2.0543306177003293,
    "sentKBytesPerSec" : 6.26598344162445
  },
  "GET /inventario/MED-RESP-SALBUT-100MCG-200D/disponibilidad" : {
    "transaction" : "GET /inventario/MED-RESP-SALBUT-100MCG-200D/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.95373891001259,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 999.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 200.21999999999935,
    "throughput" : 5.855743861302736,
    "receivedKBytesPerSec" : 2.0758226986147346,
    "sentKBytesPerSec" : 6.284631351144245
  },
  "GET /inventario/MED-DIAB-METFOR-850MG-60TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DIAB-METFOR-850MG-60TAB/disponibilidad",
    "sampleCount" : 6311,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.9695769291715,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 922.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 180.5600000000013,
    "throughput" : 5.856826529911484,
    "receivedKBytesPerSec" : 2.08190793014869,
    "sentKBytesPerSec" : 6.285793316770235
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 195671,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.0705725426865,
    "medianResTime" : 125.0,
    "minResTime" : 111.0,
    "maxResTime" : 1601.0,
    "pct1ResTime" : 132.0,
    "pct2ResTime" : 135.0,
    "pct3ResTime" : 162.0,
    "throughput" : 181.1939646151766,
    "receivedKBytesPerSec" : 64.0378287969674,
    "sentKBytesPerSec" : 194.31089263609852
  },
  "GET /inventario/MED-ANALG-IBUPRO-400MG-20CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ANALG-IBUPRO-400MG-20CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.21039290240803,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 1148.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 190.21999999999935,
    "throughput" : 5.848999081692318,
    "receivedKBytesPerSec" : 2.079140012037151,
    "sentKBytesPerSec" : 6.283104482286669
  },
  "GET /inventario/MED-RESP-BUDESO-200MCG-200D/disponibilidad" : {
    "transaction" : "GET /inventario/MED-RESP-BUDESO-200MCG-200D/disponibilidad",
    "sampleCount" : 6311,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.80288385358877,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 444.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 152.0,
    "throughput" : 5.856261309330488,
    "receivedKBytesPerSec" : 2.0702798769312856,
    "sentKBytesPerSec" : 6.2851866981974664
  },
  "GET /inventario/MED-ALERG-DIPHEN-25MG-24CAP/disponibilidad" : {
    "transaction" : "GET /inventario/MED-ALERG-DIPHEN-25MG-24CAP/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.02677439797218,
    "medianResTime" : 125.0,
    "minResTime" : 113.0,
    "maxResTime" : 1505.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 183.0,
    "throughput" : 5.85396798309843,
    "receivedKBytesPerSec" : 2.0751822930916317,
    "sentKBytesPerSec" : 6.282725403735522
  },
  "GET /inventario/MED-LAX-LACTUL-667-120ML/disponibilidad" : {
    "transaction" : "GET /inventario/MED-LAX-LACTUL-667-120ML/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.2707541191381,
    "medianResTime" : 125.0,
    "minResTime" : 111.0,
    "maxResTime" : 906.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 228.8699999999999,
    "throughput" : 5.860027777571467,
    "receivedKBytesPerSec" : 2.0601660155524693,
    "sentKBytesPerSec" : 6.272060980681962
  },
  "GET /inventario/MED-DIAB-GLIBEN-5MG-30TAB/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DIAB-GLIBEN-5MG-30TAB/disponibilidad",
    "sampleCount" : 6311,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.63048645222621,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 699.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 162.64000000000033,
    "throughput" : 5.85646781958627,
    "receivedKBytesPerSec" : 2.0646372995915967,
    "sentKBytesPerSec" : 6.273969920005994
  },
  "GET /inventario/MED-DIAB-INSUGL-100UML-10ML/disponibilidad" : {
    "transaction" : "GET /inventario/MED-DIAB-INSUGL-100UML-10ML/disponibilidad",
    "sampleCount" : 6312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.11596958174898,
    "medianResTime" : 125.0,
    "minResTime" : 112.0,
    "maxResTime" : 859.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 136.0,
    "pct3ResTime" : 177.6999999999989,
    "throughput" : 5.857216430271564,
    "receivedKBytesPerSec" : 2.07061390230549,
    "sentKBytesPerSec" : 6.286211774285595
  }
}